{
  "plate": 18,
  "topic": "Korean Nationalism",
  "date": "2026-02-18",
  "generatedAt": "2026-02-18T08:00:00.000Z",
  "readings": [
    "Korean Nationalism Combined (Sources of Korean Tradition, pp. 294-351)"
  ],
  "readingAnalyses": [
    {
      "title": "Yi Kangnyŏn: Open Letter to Itō Hirobumi",
      "author": "Yi Kangnyŏn (이강년, 1858-1908)",
      "source": "Sources of Korean Tradition, Vol. 2",
      "pages": "pp. 294-295",
      "type": "primary",
      "summary": "A Righteous Army commander writes directly to Japan's Resident-General. Yi Kangnyŏn's letter is a point-by-point indictment of Japanese imperialism: invasion, assassination of Queen Min, exploitation of finances, violation of the Treaty of Shimonoseki. The tone is furious and uncompromising, backed by the threat of armed resistance from guerrilla forces across the Korean countryside.",
      "keyQuotes": [
        {"quote": "Have we asked to become a colony of your country, a nation devoid of morality?", "page": "294"},
        {"quote": "You have violated international commitments vis-a-vis other nations. You have deceived your own sovereign. In our country, you have become an unforgivable enemy.", "page": "294"}
      ],
      "thematicExamples": [
        "Armed resistance as first response to colonialism",
        "Confucian scholar turned guerrilla commander",
        "Invocation of international law and treaty obligations"
      ]
    },
    {
      "title": "The Patriotic Enlightenment Movement",
      "author": "Korean Association for Self-Strengthening (Taehan Chaganghoe)",
      "source": "Sources of Korean Tradition, Vol. 2",
      "pages": "pp. 295-296",
      "type": "primary",
      "summary": "After 1905, private associations emerged promoting education and economic development as paths to eventual independence. The Korean Association for Self-Strengthening (est. March 1906), led by Yun Ch'iho with Chang Chiyŏn and Yun Hyojŏng, aimed to build Korea into a modern nation strong enough to resist Japan. A fundamentally different strategy from armed resistance: national capacity-building rather than military confrontation.",
      "keyQuotes": [
        {"quote": "The enlightenment movement aimed at building up Korea as a modern advanced nation with a strong economic base in order to push Japan out eventually.", "page": "295"}
      ],
      "thematicExamples": [
        "Education as national resistance",
        "Economic development for sovereignty",
        "Self-strengthening as alternative to armed resistance"
      ]
    },
    {
      "title": "Son Pyŏnghŭi and Others: Declaration of Independence",
      "author": "Drafted by Ch'oe Namsŏn; signed by 33 representatives",
      "source": "Korean Studies 13:1-4",
      "pages": "pp. 336-339",
      "type": "primary",
      "summary": "The centerpiece document. Drafted by the 29-year-old publisher Ch'oe Namsŏn, read aloud on March 1, 1919, this declaration sparked massive nationwide protests. The tone is remarkably dignified and non-violent: it frames Korean independence as universal justice, explicitly refuses to demonize Japan, and commits to moral suasion over violence. The 33 signers (15 Ch'ŏndogyo, 16 Christian, 2 Buddhist) called the police after reading it and waited to be arrested.",
      "keyQuotes": [
        {"quote": "We hereby declare that Korea is an independent state and that Koreans are a self-governing people.", "page": "337"},
        {"quote": "Our task today is to build up our own strength, not to destroy others.", "page": "338"},
        {"quote": "Our action today represents the demand of our people for justice, humanity, survival, and dignity.", "page": "339"}
      ],
      "thematicExamples": [
        "Non-violent resistance strategy predating Gandhi",
        "Wilsonian moment: hopes that self-determination would apply to colonies",
        "Religion as organizational backbone (Japan controlled all secular institutions)",
        "Moral appeal to international community"
      ]
    },
    {
      "title": "Provisional Constitution of the Korean Government in Exile",
      "author": "Korean Provisional Government",
      "source": "Hanguk tongnip undong sa 3:326",
      "pages": "p. 339",
      "type": "primary",
      "summary": "Within weeks of March First, Korean activists established a provisional government in Shanghai's French Concession. Its constitution is strikingly modern: democratic republic, no class distinctions, equality of men and women. Yi Tongnyŏng headed the legislature; Syngman Rhee the executive. This government became the rallying point for Korean independence until 1945."
    },
    {
      "title": "Declaration of War on Japan (9 December 1941)",
      "author": "Korean Provisional Government",
      "source": "Tongnip undong sa 6:260",
      "pages": "pp. 350-351",
      "type": "primary",
      "summary": "Two days after Pearl Harbor, the Korean Provisional Government declared war on Japan, aligning with the Allied powers. The declaration voids the 1910 annexation treaty and all unequal treaties, invokes the Atlantic Charter's promise of self-government, and commits to fighting to final victory. An assertion of sovereignty by a government that no major power recognized."
    }
  ],
  "overallSynthesis": "These six documents trace a 46-year evolution in Korean resistance strategy: armed guerrilla warfare (Yi Kangnyŏn, 1895-1908), enlightenment-era self-strengthening (1906), moral appeal to universal justice (March First, 1919), exile government-building (Shanghai, 1919), and finally military alliance (1941).\n\nEach strategy failed on its own terms. The Righteous Armies were outgunned. Self-strengthening was overtaken by annexation. The March First moral appeal fell on deaf ears at Versailles. The Provisional Government spent 26 years without diplomatic recognition. Yet the fire of Korean nationalism was kept alive throughout 35 years of colonial rule.\n\nThe contrast with Japanese nationalism (Plate 17) is sharp. Where Tokutomi Sohō embraced Social Darwinist competition, Korean nationalists appealed to international law and human dignity. Where Japan sought to dominate, Korea sought recognition. Japanese nationalism was about power; Korean nationalism was about justice.\n\nThe comparison with Chinese nationalism (Plate 19) is instructive. Both emerged from humiliation and resistance. But Korean nationalism crystallized under direct colonial occupation, creating a sharper victim identity. Chinese nationalism developed in a semi-colonial context with more room for internal debate.",
  "executiveSummary": "Six documents spanning 1895-1941 trace the arc of Korean resistance to Japanese imperialism. Yi Kangnyŏn's Open Letter to Itō Hirobumi (pp. 294-295) is the voice of armed resistance from the Righteous Armies. The Patriotic Enlightenment Movement (pp. 295-296) represents the bet on education and economic self-strengthening. The Declaration of Independence (pp. 336-339), drafted by Ch'oe Namsŏn and signed by 33 representatives, is the centerpiece: a remarkably dignified, non-violent appeal to universal justice that sparked the March First Movement of 1919. The Provisional Constitution (p. 339) established a democratic exile government in Shanghai. The Declaration of War (pp. 350-351), issued two days after Pearl Harbor, aligned Korea with the Allied powers.\n\nThree strategies, one goal: armed resistance, self-strengthening, moral appeal. All failed to achieve independence directly. Japan was too strong, the international community indifferent. Yet each built the scaffolding of Korean national identity that persists today.",
  "keywords": [
    {
      "term": "Righteous Armies (ŭibyŏng, 의병)",
      "definition": "Volunteer guerrilla forces raised by Confucian scholars to resist Japanese encroachment",
      "relevance": "First phase of Korean resistance; Yi Kangnyŏn was a key commander"
    },
    {
      "term": "March First Movement (3·1 운동)",
      "definition": "1919 mass protests for Korean independence, triggered by Declaration of Independence",
      "relevance": "Foundational event for Korean nationalism; national holiday in South Korea"
    },
    {
      "term": "Taehan Chaganghoe (대한자강회)",
      "definition": "Korean Association for Self-Strengthening, established March 1906",
      "relevance": "Enlightenment-era strategy: build national capacity through education and economic development"
    },
    {
      "term": "Ch'ŏndogyo (천도교)",
      "definition": "Religion of the Heavenly Way, successor to Tonghak, reorganized by Son Pyŏnghŭi in 1905",
      "relevance": "15 of the 33 Declaration signers were Ch'ŏndogyo leaders; religious networks as organizational backbone"
    },
    {
      "term": "Korean Provisional Government (대한민국 임시정부)",
      "definition": "Exile government established in Shanghai, April 1919",
      "relevance": "Rallying point for Korean independence; produced democratic constitution"
    },
    {
      "term": "Wilsonian Moment",
      "definition": "Post-WWI hopes that Wilson's 'self-determination' would apply to colonized peoples",
      "relevance": "Koreans believed international support would help; it didn't. Self-determination applied to European nations, not Asian colonies."
    }
  ],
  "keyPassages": [
    {
      "quote": "Have we asked to become a colony of your country, a nation devoid of morality? ... You have deceived your own sovereign. In our country, you have become an unforgivable enemy.",
      "source": "Yi Kangnyŏn, Open Letter to Itō Hirobumi",
      "page": "294"
    },
    {
      "quote": "We hereby declare that Korea is an independent state and that Koreans are a self-governing people. We proclaim it to the nations of the world in affirmation of the principle of the equality of all nations.",
      "source": "Declaration of Independence",
      "page": "337"
    },
    {
      "quote": "Our task today is to build up our own strength, not to destroy others. We must chart a new course for ourselves in accord with the solemn dictates of conscience.",
      "source": "Declaration of Independence",
      "page": "338"
    }
  ],
  "peopleplacesthings": {
    "people": [
      "Yi Kangnyŏn (1858-1908) - Righteous Army commander, author of Open Letter to Itō",
      "Yun Ch'iho (1864-1945) - Enlightenment leader, Self-Strengthening Association",
      "Chang Chiyŏn (1864-1921) - Journalist, 'I Wail Bitterly Today' editorial",
      "Son Pyŏnghŭi (1861-1922) - Ch'ŏndogyo leader, first signer of Declaration",
      "Ch'oe Namsŏn (1890-1957) - Drafted the Declaration of Independence at age 29",
      "Han Yongun (1879-1944) - Buddhist monk, poet, signer, drafted the Three Pledges",
      "Syngman Rhee (1875-1965) - Provisional Government president, later ROK president"
    ],
    "places": [
      "Taehwagwan Restaurant, Seoul - where Declaration was read, March 1, 1919",
      "Shanghai French Concession - site of Korean Provisional Government",
      "Sŏdaemun Prison - where nationalists were imprisoned and executed",
      "Vladivostok - site of Korean national congress, March 17, 1919"
    ],
    "things": [
      "Declaration of Independence (1919) - founding document of Korean nationalism",
      "Treaty of Shimonoseki (1895) - recognized Korean independence; Japan later violated it",
      "Eulsa Treaty (1905) - stripped Korea of diplomatic sovereignty",
      "Provisional Constitution (1919) - democratic republic, gender equality, no class distinctions"
    ]
  },
  "keyQuestions": [
    {
      "question": "The reading contains three distinct strategies for Korean resistance: armed revolt (Righteous Armies), self-strengthening (enlightenment movement), and moral appeal (March First Declaration). Which was most effective, and why?",
      "basicAnswer": "Each strategy failed to achieve independence directly. The Righteous Armies were outgunned, self-strengthening was overtaken by annexation, and the moral appeal was ignored at Versailles.",
      "midAnswer": "None achieved independence, but March First succeeded as nation-building. It created national consciousness, martyrs, a founding myth, and an exile government. The movement's 'failure' produced the identity infrastructure that both Koreas still use.",
      "advancedAnswer": "The question itself reveals a bias. 'Effectiveness' measured by independence is a power framework. The Declaration's authors explicitly rejected that framework: 'Our task today is to build up our own strength, not to destroy others.' They were playing a different game, one measured by moral clarity and national consciousness rather than military victory."
    },
    {
      "question": "How does Korean nationalism (Plate 18) differ from Japanese nationalism (Plate 17)?",
      "basicAnswer": "Japanese nationalism was expansionist, based on power and Social Darwinism. Korean nationalism was defensive, based on victimhood and justice claims.",
      "midAnswer": "They operate in different frameworks. Tokutomi Sohō's Japanese nationalism asks 'How do we dominate?' Korean nationalists ask 'How do we survive with dignity?' Japan cited the logic of the strong; Korea appealed to the conscience of the world.",
      "advancedAnswer": "Korean nationalism was forged in the crucible of Japanese nationalism. Without Japanese imperialism, Korean national consciousness might have developed very differently. The Declaration's non-violent, morally-grounded approach was a strategic response to overwhelming military disadvantage: when you can't win by force, you compete on legitimacy."
    }
  ],
  "timeline": [
    {"date": "1895", "event": "Queen Min assassinated; first Righteous Armies raised"},
    {"date": "1905", "event": "Eulsa Treaty makes Korea a Japanese protectorate"},
    {"date": "1906", "event": "Korean Association for Self-Strengthening founded"},
    {"date": "1907", "event": "Korean army disbanded; second wave of Righteous Armies"},
    {"date": "1908", "event": "Yi Kangnyŏn captured and executed at Sŏdaemun Prison"},
    {"date": "1910", "event": "Japan formally annexes Korea"},
    {"date": "Mar 1, 1919", "event": "Declaration of Independence read; March First Movement begins"},
    {"date": "Apr 1919", "event": "Provisional Government established in Shanghai"},
    {"date": "Dec 9, 1941", "event": "Provisional Government declares war on Japan"},
    {"date": "Aug 1945", "event": "Liberation from Japan (but then division)"}
  ],
  "connections": {
    "fromPrevious": "Plate 17 examined the Japanese nationalism that justified colonizing Korea (Tokutomi Sohō's Social Darwinism). Now we see the Korean response: not counter-aggression, but moral appeal.",
    "toNext": "Plate 19 examines Chinese nationalism through Lu Xun's 'True Story of Ah Q.' Both Korean and Chinese nationalisms emerged from humiliation, but in different contexts: direct colonial occupation vs. semi-colonial exploitation.",
    "broaderThemes": "Colonialism creates nationalism among the colonized. But the content varies. Korean nationalism emphasized victimhood and moral claims. Chinese nationalism turned inward toward self-criticism. Japanese nationalism reached for power. Three responses to the same modern moment."
  },
  "nextPreview": {
    "plate": 19,
    "topic": "Chinese Nationalism",
    "preview": "Chinese nationalism emerged from the 'century of humiliation.' Lu Xun's 'True Story of Ah Q' offers a scathing critique of Chinese national character. Where the Korean Declaration looks outward (appealing to the world), Lu Xun looks inward (diagnosing China's own failures).",
    "readings": ["The True Story of Ah Q (Lu Xun)"]
  },
  "teachingNotes": [
    "Read the Declaration of Independence aloud in class. It is eloquent and moving.",
    "The Open Letter to Itō is NOT by An Jung-geun (a common confusion). It's by Yi Kangnyŏn, a Righteous Army commander.",
    "Key comparison: 33 signers called the police on themselves and waited to be arrested. Contrast this with armed resistance.",
    "Religious composition of the 33 signers (15 Ch'ŏndogyo, 16 Christian, 2 Buddhist) is analytically important: religion was the only organizational space Japan didn't fully control.",
    "The Declaration's refusal to blame Japan ('we must first blame ourselves') is strategically sophisticated, not naïve."
  ],
  "authorBios": [
    {
      "name": "Yi Kangnyŏn",
      "nameKr": "이강년",
      "dates": "1858-1908",
      "role": "Righteous Army Commander",
      "bio": "Confucian scholar from Mungyŏng who first raised volunteer forces in 1895 after the assassination of Queen Min. Became a general in the Thirteen Provinces Alliance. Captured and executed at Sŏdaemun Prison in 1908."
    },
    {
      "name": "Yun Ch'iho",
      "nameKr": "윤치호",
      "dates": "1864-1945",
      "role": "Enlightenment Leader",
      "bio": "Western-educated intellectual (Vanderbilt, Emory) who led the Independence Club and Korean Association for Self-Strengthening. Later collaborated with Japan, earning the label ch'inilp'a."
    },
    {
      "name": "Chang Chiyŏn",
      "nameKr": "장지연",
      "dates": "1864-1921",
      "role": "Journalist & Patriot",
      "bio": "Editor of the Hwangsŏng sinmun. Famous for his 1905 editorial 'I Wail Bitterly Today' denouncing the Eulsa Treaty. Arrested for the editorial; became a symbol of press resistance."
    },
    {
      "name": "Son Pyŏnghŭi",
      "nameKr": "손병희",
      "dates": "1861-1922",
      "role": "Ch'ŏndogyo Leader",
      "bio": "Third leader of the Tonghak movement, who reorganized it as Ch'ŏndogyo in 1905. First signer of the Declaration of Independence. Read it at Taehwagwan Restaurant, then phoned the police. Died after falling ill in prison."
    },
    {
      "name": "Ch'oe Namsŏn",
      "nameKr": "최남선",
      "dates": "1890-1957",
      "role": "Writer & Publisher",
      "bio": "Founded Korea's first modern magazine (Sonyŏn) at age 18. Drafted the Declaration of Independence at age 29. Did not sign it himself. Later imprisoned, then collaborated with Japan during wartime."
    },
    {
      "name": "Han Yongun",
      "nameKr": "한용운",
      "dates": "1879-1944",
      "role": "Buddhist Monk & Poet",
      "bio": "Buddhist reformer, one of the 33 signers, drafted the Three Open Pledges. Published 'Nim ŭi ch'immuk' (Your Silence), a landmark of modern Korean literature. Built his house facing away from the Japanese Government-General building in defiance. Never collaborated."
    },
    {
      "name": "Syngman Rhee",
      "nameKr": "이승만",
      "dates": "1875-1965",
      "role": "Provisional Government President",
      "bio": "First Korean to hold an American doctorate (Princeton, 1910). Elected president of the Korean Provisional Government in Shanghai. Later became first president of the Republic of Korea. Authoritarian ruler, overthrown by student revolution in 1960."
    }
  ],
  "map": {
    "center": [37.5, 127],
    "zoom": 5,
    "locations": [
      {
        "name": "Seoul",
        "nameChinese": "서울",
        "lat": 37.5665,
        "lng": 126.9780,
        "type": "capital",
        "description": "Taehwagwan Restaurant (Declaration read here); Sŏdaemun Prison; Pagoda Park"
      },
      {
        "name": "Mungyŏng",
        "lat": 36.5936,
        "lng": 128.1986,
        "type": "battle",
        "description": "Home of Yi Kangnyŏn; center of Righteous Army resistance"
      },
      {
        "name": "Shanghai",
        "nameChinese": "上海",
        "lat": 31.2304,
        "lng": 121.4737,
        "type": "city",
        "description": "Korean Provisional Government established in French Concession, April 1919"
      },
      {
        "name": "Vladivostok",
        "lat": 43.1332,
        "lng": 131.9113,
        "type": "city",
        "description": "Korean national congress, March 17, 1919; half a million Korean residents"
      },
      {
        "name": "Cheonan",
        "nameChinese": "천안",
        "lat": 36.8151,
        "lng": 127.1139,
        "type": "other",
        "description": "Independence Hall of Korea; memorial site"
      }
    ]
  }
}
