{
  "plate": 11,
  "topic": "Tokugawa vs. the West",
  "date": "2026-01-31",
  "generatedAt": "2026-01-29T12:00:00.000Z",
  "readings": [
    "The Harris Treaty of 1858",
    "Daimyo Responses to American Demands"
  ],
  "readingAnalyses": [
    {
      "title": "The Harris Treaty of 1858",
      "author": "Townsend Harris / Tokugawa negotiators",
      "source": "Treaty of Amity and Commerce, 1858",
      "pages": "pp. 1-2",
      "type": "primary",
      "summary": "The Harris Treaty established formal commercial and diplomatic relations between the United States and Japan, opening multiple ports to American trade and residence. Signed on July 29, 1858, it granted Americans extraterritoriality (trial in US consular courts), fixed tariff rates, and the right to reside in specified cities. Unlike China's treaties imposed after military defeat, Japan negotiated this treaty voluntarily—though under implicit threat of force.",
      "keyQuotes": [
        {
          "quote": "Americans committing offenses against Japanese shall be tried in American Consular courts, and, when guilty, shall be punished according to American law.",
          "page": "Article VI"
        },
        {
          "quote": "No wall, fence, or gate shall be erected by the Japanese around the place of residence of the Americans, or anything done which may prevent a free egress and ingress to the same.",
          "page": "Article III"
        },
        {
          "quote": "The importation of opium is prohibited; and, any American vessel coming to Japan for the purposes of trade having more than four pounds weight of opium on board, such surplus quantity shall be seized and destroyed by the Japanese authorities.",
          "page": "Article IV"
        }
      ],
      "thematicExamples": [
        "Extraterritoriality (Article VI): Americans beyond Japanese law—the same humiliation imposed on China",
        "Port openings with specific dates: Kanagawa and Nagasaki (July 4, 1859), Niigata (Jan 1, 1860), Hyogo (Jan 1, 1863)",
        "Religious freedom guaranteed (Article VIII): 'Americans in Japan shall be allowed the free exercise of their religion'",
        "Opium prohibition: Unlike China, Japan explicitly banned opium imports—learning from China's experience"
      ],
      "realLifeConnections": [
        "Status of Forces Agreements for US military bases in Japan today echo extraterritoriality debates—who has legal jurisdiction over American service members?",
        "Japan's relentless pursuit of treaty revision (finally achieved 1899) shows how 'unequal' status motivated rapid modernization",
        "Contemporary trade negotiations still involve tensions between sovereignty and external pressure"
      ]
    },
    {
      "title": "Daimyo Responses to American Demands",
      "author": "Tokugawa Nariaki and Ii Naosuke",
      "source": "Beasley, Selected Documents on Japanese Foreign Policy, 1853-1868 (Oxford UP, 1955)",
      "pages": "pp. 1-7",
      "type": "primary",
      "summary": "These two letters to the Bakufu represent opposing Japanese responses to Perry's demands. Tokugawa Nariaki (August 14, 1853) presents TEN REASONS to reject peace and resist the foreigners, emphasizing national honor, the danger of Christianity, and the morale-boosting effects of resistance. Ii Naosuke (October 1, 1853) argues the opposite: conditions have changed, seclusion is no longer viable, and Japan should open trade strategically to buy time for military modernization.",
      "keyQuotes": [
        {
          "quote": "If we put our trust in war, the whole country's morale will be increased and even if we sustain an initial defeat, we will in the end expel the foreigner; while if we put our trust in peace, even though things may seem tranquil for a time, the morale of the country will be greatly lowered and we will come in the end to complete collapse.",
          "page": "Nariaki, p. 1"
        },
        {
          "quote": "The Americans who arrived recently, though fully aware of the Bakufu's prohibition, entered Uraga displaying a white flag as a symbol of peace and insisted on presenting their written request... They were arrogant and discourteous, their actions an outrage. Indeed, this was the greatest disgrace we have suffered since the dawn of our history.",
          "page": "Nariaki, p. 1"
        },
        {
          "quote": "There is a saying that when one is besieged in a castle, to raise the drawbridge is to imprison oneself and make it impossible to hold out indefinitely; and again, that when opposing forces face each other across a river, victory is obtained by those who cross the river and attack.",
          "page": "Ii Naosuke, p. 5"
        },
        {
          "quote": "We must revive the licensed trading vessels... We must construct new steamships, especially powerful warships... Openly these will be called merchant vessels, but they will in fact have the secret purpose of training a navy.",
          "page": "Ii Naosuke, p. 6"
        },
        {
          "quote": "I do not see how the people of our country, who are clever and quick-witted, should prove inferior to Westerners if we begin training at once.",
          "page": "Ii Naosuke, p. 6"
        }
      ],
      "thematicExamples": [
        "Nariaki's 10 reasons against peace: (1) national prestige, (2) Christianity threat, (3) trade drains resources, (4) precedent for other powers, (5) foothold leads to more demands, (6) isolation allows future strength, (7) ignoring intrusion exhausts people, (8) undermines coastal defense, (9) even commoners feel outrage, (10) morale vs. preparedness",
        "Ii Naosuke's counter-argument: use trade as 'bridge' to buy time, build navy secretly as 'merchant vessels,' learn Western navigation, then reimpose seclusion from strength",
        "Both cite China's example: Nariaki warns of repeating Opium War disaster; Ii Naosuke notes Japan must adapt because conditions have changed"
      ],
      "realLifeConnections": [
        "Hawks vs. doves in foreign policy debates mirror Nariaki vs. Ii Naosuke positions",
        "The idea of 'strategic opening' (engage to strengthen, then compete) remains relevant in discussions of China-US relations today",
        "Popular anger at perceived national humiliation ('even commoners think them abominable') drives nationalist movements worldwide"
      ]
    }
  ],
  "overallSynthesis": "The Harris Treaty and daimyo responses together reveal Japan at a crossroads—facing the same Western pressure as China but responding through intense internal debate rather than immediate war. The treaty itself shows Japan entering the Western treaty system on terms similar to China's 'unequal treaties': extraterritoriality, fixed tariffs, and port openings. Yet the circumstances differed: Japan signed without military defeat, through negotiation rather than conquest.\n\nThe daimyo debates are remarkable for their sophistication and their revelation of genuine disagreement. Tokugawa Nariaki's passionate call for resistance drew on historical precedents (defeating the Mongols, conquering Korea) and warned that accommodation would lead to 'complete collapse.' Ii Naosuke's pragmatic counter-argument acknowledged that 'conditions are not the same as they were' and proposed using trade strategically to build strength. His metaphor of the castle siege—'to raise the drawbridge is to imprison oneself'—captured the dilemma of isolation.\n\nCrucially, Ii Naosuke eventually prevailed and signed the treaties, but was assassinated in 1860 by Nariaki's supporters. The 'expel the barbarians' faction would attempt armed resistance and fail spectacularly (bombardment of Shimonoseki, 1864). Only then did the 'learn from the West to resist the West' position become consensus—but by different actors (Satsuma and Choshu domains) who would overthrow the Tokugawa entirely. Japan's response wasn't predetermined; it emerged from contested debate and contingent violence.",
  "executiveSummary": "Plate 11 examines Japan's encounter with American demands through two complementary readings. The Harris Treaty (1858) shows the legal framework Japan accepted: extraterritoriality for Americans, fixed tariffs, and port openings—similar to China's 'unequal treaties' but signed through negotiation rather than military defeat. The Daimyo Responses reveal intense debate within Japan: Tokugawa Nariaki argued passionately for armed resistance ('the greatest disgrace we have suffered since the dawn of our history'), while Ii Naosuke advocated strategic accommodation ('to raise the drawbridge is to imprison oneself'). Both cited China's example; both saw themselves as patriots. The outcome wasn't predetermined—Ii Naosuke signed the treaties and was assassinated for it. Japan's transformation emerged from this violent contest of ideas, not cultural destiny.",
  "keywords": [
    {
      "term": "Extraterritoriality",
      "definition": "Foreigners tried under their own laws, not Japanese law",
      "relevance": "Core grievance of 'unequal treaties'; Japan spent decades working to revise"
    },
    {
      "term": "Bakufu (幕府)",
      "definition": "Military government of the Shogun; ruled Japan since 1603",
      "relevance": "The institution that faced the crisis and ultimately fell (1868)"
    },
    {
      "term": "Daimyo (大名)",
      "definition": "Feudal lords ruling semi-autonomous domains",
      "relevance": "Bakufu consulted them on foreign policy—unprecedented, showing weakness"
    },
    {
      "term": "Sonnō jōi (尊王攘夷)",
      "definition": "'Revere the Emperor, Expel the Barbarians'",
      "relevance": "Nariaki's position; became rallying cry but later transformed"
    },
    {
      "term": "Sakoku (鎖国)",
      "definition": "'Closed country'—Japan's seclusion policy since 1630s",
      "relevance": "What the treaties ended; Ii Naosuke argued it was no longer viable"
    }
  ],
  "keyPassages": [
    {
      "quote": "Americans committing offenses against Japanese shall be tried in American Consular courts, and, when guilty, shall be punished according to American law.",
      "source": "Harris Treaty, Article VI",
      "page": "Article VI"
    },
    {
      "quote": "This was the greatest disgrace we have suffered since the dawn of our history... if the enemy dictates terms in one's own capital, one's country is disgraced.",
      "source": "Tokugawa Nariaki to Bakufu, August 14, 1853",
      "page": "p. 1"
    },
    {
      "quote": "When one is besieged in a castle, to raise the drawbridge is to imprison oneself and make it impossible to hold out indefinitely.",
      "source": "Ii Naosuke to Bakufu, October 1, 1853",
      "page": "p. 5"
    }
  ],
  "peopleplacesthings": {
    "people": [
      "Townsend Harris — US Consul-General who negotiated the 1858 treaty",
      "Tokugawa Nariaki — Daimyo who argued for armed resistance; gave 10 reasons against peace",
      "Ii Naosuke — Bakufu official who signed treaties; assassinated 1860"
    ],
    "places": [
      "Uraga (Edo Bay) — Where Perry's Black Ships arrived; 'greatest disgrace'",
      "Kanagawa/Yokohama — First major treaty port; opened July 4, 1859",
      "Nagasaki — Existing Dutch trade window; opened to Americans 1859"
    ],
    "things": [
      "Harris Treaty (1858) — Commercial treaty granting extraterritoriality and port openings",
      "Extraterritoriality — Americans tried under US law, not Japanese",
      "Ten Reasons Against Peace — Nariaki's systematic argument for resistance"
    ]
  },
  "keyQuestions": [
    {
      "question": "Nariaki: 'The greatest disgrace we have suffered since the dawn of our history.' Ii Naosuke: 'To raise the drawbridge is to imprison oneself.' Who was right?",
      "talkingPoints": "Both were patriots with different strategic assessments. Nariaki emphasized honor and morale; Ii Naosuke emphasized survival and adaptation. History vindicated Ii Naosuke's approach—but only after Nariaki's followers tried armed resistance and failed. The question isn't who was 'right' but what conditions made each position viable."
    },
    {
      "question": "The Harris Treaty explicitly banned opium (unlike China's treaties). What does this tell us about Japan's position compared to China's?",
      "talkingPoints": "Japan learned from China's disaster. But don't overstate the difference—Japan still accepted extraterritoriality and fixed tariffs. The opium clause shows negotiating room, not fundamentally different treatment. Japan signed from weakness, just with slightly better terms."
    },
    {
      "question": "Ii Naosuke proposed building warships disguised as merchant vessels to secretly train a navy. Is deception justified when facing a stronger power?",
      "talkingPoints": "This is the 'strategic opening' argument: engage to strengthen, then compete. It's also a question about sovereignty under duress. Ii Naosuke acknowledged he was 'putting forward views that conflict with existing laws'—he knew he was advocating revolutionary change."
    }
  ],
  "timeline": [
    {
      "date": "1853",
      "event": "Perry arrives at Uraga; Nariaki and Ii Naosuke write their responses"
    },
    {
      "date": "1854",
      "event": "Convention of Kanagawa—first treaty; limited openings"
    },
    {
      "date": "1858",
      "event": "Harris Treaty signed—extraterritoriality, more ports"
    },
    {
      "date": "1860",
      "event": "Ii Naosuke assassinated by pro-resistance samurai"
    },
    {
      "date": "1864",
      "event": "Western bombardment of Shimonoseki; resistance faction defeated"
    },
    {
      "date": "1868",
      "event": "Meiji Restoration; Tokugawa Bakufu falls"
    }
  ],
  "connections": {
    "fromPrevious": "Plate 10 examined China's 'opening' via the Opium War and Treaty of Nanjing. Japan faced similar pressure but with key differences: 15 years of warning, no concurrent civil war (like Taiping), and American demands for ports rather than drug markets. The daimyo responses show Japanese leaders actively debating China's example.",
    "toNext": "Plate 12 covers the Meiji Transformation. The 'learn from the West to resist the West' position (Ii Naosuke's approach) eventually triumphed—but through different actors (Satsuma, Choshu) who overthrew the Tokugawa entirely. The transformation emerged from this contested debate, not cultural destiny.",
    "broaderThemes": "Both China and Japan faced Western pressure and signed 'unequal treaties.' The question isn't 'why did Japan succeed and China fail?'—both were humiliated, both eventually recovered. Better question: What structural differences (decentralized domains vs. centralized empire, absence vs. presence of civil war) shaped different paths?"
  },
  "nextPreview": {
    "plate": 12,
    "topic": "Meiji Transformation",
    "preview": "The Meiji government launched comprehensive reforms: abolishing domains, creating conscript army, building railroads, drafting constitution. How did the 'learn from the West' faction implement their vision after defeating the 'expel the barbarians' position?",
    "readings": ["Meiji Primary Sources"]
  },
  "teachingNotes": [
    "KEY QUOTES: Nariaki's 'greatest disgrace since the dawn of history' vs. Ii Naosuke's 'to raise the drawbridge is to imprison oneself' — have students debate which position was more justified",
    "Ii Naosuke's assassination (1860) shows the debate wasn't just rhetorical—people died for these positions. History emerges from violence, not consensus.",
    "The opium clause in the Harris Treaty is significant—Japan explicitly learned from China's disaster. But don't let students think Japan got a 'better deal'—extraterritoriality was still imposed.",
    "Compare with Plate 10: Both China and Japan signed 'unequal treaties.' Reject the 'Japan succeeded, China failed' framing. Better: What obstacles did each face in responding?",
    "Ii Naosuke's 'secret navy' proposal shows sophisticated strategic thinking—engage to buy time, build strength, then compete. This is still a live debate in international relations.",
    "VISUAL: MIT Visualizing Cultures 'Black Ships and Samurai' has excellent images of Perry's arrival and Japanese responses"
  ],
  "map": {
    "center": [35.5, 139],
    "zoom": 6,
    "locations": [
      {
        "name": "Uraga (Edo Bay)",
        "nameChinese": "浦賀",
        "lat": 35.2297,
        "lng": 139.7234,
        "type": "other",
        "description": "Where Perry's Black Ships first anchored, July 1853—'greatest disgrace'"
      },
      {
        "name": "Edo (Tokyo)",
        "nameChinese": "江戸",
        "lat": 35.6762,
        "lng": 139.6503,
        "type": "capital",
        "description": "Shogunal capital; Americans allowed to reside from Jan 1862"
      },
      {
        "name": "Kanagawa/Yokohama",
        "nameChinese": "横浜",
        "lat": 35.4437,
        "lng": 139.6380,
        "type": "city",
        "description": "Major treaty port; opened July 4, 1859"
      },
      {
        "name": "Nagasaki",
        "nameChinese": "長崎",
        "lat": 32.7503,
        "lng": 129.8779,
        "type": "city",
        "description": "Existing Dutch trade window; opened to Americans July 4, 1859"
      },
      {
        "name": "Shimoda",
        "nameChinese": "下田",
        "lat": 34.6711,
        "lng": 138.9451,
        "type": "city",
        "description": "First port opened (1854); closed after Kanagawa opened"
      },
      {
        "name": "Hakodate",
        "nameChinese": "函館",
        "lat": 41.7686,
        "lng": 140.7288,
        "type": "city",
        "description": "Northern port; opened 1854"
      },
      {
        "name": "Hyogo (Kobe)",
        "nameChinese": "兵庫",
        "lat": 34.6901,
        "lng": 135.1955,
        "type": "city",
        "description": "To open January 1, 1863 per treaty"
      }
    ]
  }
}
