{
  "plate": 14,
  "topic": "Tonghak Rebellion",
  "date": "2026-02-06",
  "generatedAt": "2026-01-15T12:00:00Z",
  "readings": [
    "Tonghak Uprisings (Sources of Korean Tradition)",
    "Revolutionary Uprising of Tonghak Peasant Army (New History of Korea)"
  ],
  "readingAnalyses": [
    {
      "title": "Tonghak Uprisings",
      "author": "Ch'oe Cheu, Ch'oe Sihyong",
      "source": "Sources of Korean Tradition, pp. 228-235",
      "pages": "pp. 228-235",
      "type": "primary",
      "summary": "Three foundational Tonghak texts reveal the religious ideology that inspired Korea's greatest peasant uprising. Ch'oe Cheu's 'On Spreading Virtue' (1861) describes his mystical revelation and founding of Eastern Learning as a response to the Western threat. 'On Learning Truth' (1861) elaborates Tonghak theology, positioning it as distinct from yet comparable to Christianity. Ch'oe Sihyong's 'On Practicing Truth at Home' (1888) provides practical moral guidance for common believers. Together these texts show how Tonghak combined Confucian ethics, Buddhist cosmology, Daoist naturalism, and indigenous Korean shamanism into a syncretic religion with revolutionary social implications.",
      "keyQuotes": [
        {
          "quote": "My mind is your mind. How could men know it? They may know Heaven and earth, but they know not the spirit. Yet I am the spirit. Now you shall attain this eternal truth, cultivate it, write it, and teach it to all people.",
          "page": "p. 232",
          "verificationPath": "Course PDF (SKT pp. 228-235): https://drive.google.com/file/d/1iAFLA1nBFcfbgOcfvsaENMy5z4NgRO8_/view"
        },
        {
          "quote": "In April 1860 the whole world was in turmoil, and the hearts of the people turned evil. And a strange rumor spread in the world, saying: 'The Westerners cultivated high ethics, and there is nothing they cannot do...'",
          "page": "p. 232",
          "verificationPath": "Course PDF (SKT pp. 228-235): https://drive.google.com/file/d/1iAFLA1nBFcfbgOcfvsaENMy5z4NgRO8_/view"
        },
        {
          "quote": "Human beings are heaven (in nae ch'on) and all are equal; there are no differences among humans, so distinctions of high and low violate God's will.",
          "page": "p. 229",
          "verificationPath": "Course PDF (SKT pp. 228-235): https://drive.google.com/file/d/1iAFLA1nBFcfbgOcfvsaENMy5z4NgRO8_/view"
        },
        {
          "quote": "I was born in the East and received the truth in the East. Therefore, the Way is the Heavenly Way and the doctrine is the Eastern Learning.",
          "page": "p. 233",
          "verificationPath": "Course PDF (SKT pp. 228-235): https://drive.google.com/file/d/1iAFLA1nBFcfbgOcfvsaENMy5z4NgRO8_/view"
        },
        {
          "quote": "Treat all persons at home as God. Do filial duty to your parents with all your strength... Regard your servants as your own children, love even animals.",
          "page": "p. 234",
          "verificationPath": "Course PDF (SKT pp. 228-235): https://drive.google.com/file/d/1iAFLA1nBFcfbgOcfvsaENMy5z4NgRO8_/view"
        }
      ],
      "thematicExamples": [
        "Ch'oe Cheu's revelation parallels Hong Xiuquan's visions - both claimed divine contact during illness, but Ch'oe explicitly positioned his teaching as 'Eastern' alternative to Western Christianity",
        "The doctrine 'in nae ch'on' (human beings are heaven) provided theological basis for social equality that appealed to peasants suffering under yangban oppression",
        "Ch'oe Sihyong's practical advice (treat servants as children, love animals, don't cut young trees) shows how Tonghak offered moral framework for daily life, not just political resistance"
      ],
      "realLifeConnections": [
        "Tonghak's syncretic approach - combining multiple traditions into a new whole - parallels how modern religious movements adapt to their cultural contexts",
        "The tension between 'Eastern Learning' and 'Western Learning' anticipates ongoing debates about Asian values vs. Western universalism",
        "Ch'oe Cheu's execution (1864) for his beliefs parallels persecution of new religious movements today"
      ]
    },
    {
      "title": "Revolutionary Uprising of Tonghak Peasant Army",
      "author": "Various authors",
      "source": "New History of Korea",
      "pages": "Secondary source chapter",
      "type": "secondary",
      "summary": "This secondary source provides the historical narrative of the 1894 Tonghak Peasant Revolution, tracing events from the initial uprising in Gobu county through the capture of Jeonju, the Jeonju Peace Agreement, and the final defeat at Gongju. It contextualizes the rebellion within Korea's deepening crisis: corrupt local officials, foreign economic penetration, and the weakness of the central government. Crucially, it explains how the Joseon government's request for Chinese military assistance triggered Japanese intervention and ultimately the First Sino-Japanese War - transforming a domestic uprising into an international conflict that reshaped East Asian politics.",
      "keyQuotes": [
        {
          "quote": "We will sweep away the corrupt officials who have sucked the blood of the people.",
          "page": "Tonghak proclamation — VERIFY exact page from course PDF",
          "verificationPath": "Course PDF: https://drive.google.com/file/d/1I1ObGHD1eoZlci6KmK6s-R9kmp5Q4FND/view"
        },
        {
          "quote": "Punish corrupt officials and powerful landlords. Give land to the tillers. Drive out the Japanese and Western barbarians.",
          "page": "Twelve-point reform program — VERIFY exact page from course PDF",
          "verificationPath": "Course PDF: https://drive.google.com/file/d/1I1ObGHD1eoZlci6KmK6s-R9kmp5Q4FND/view"
        }
      ],
      "thematicExamples": [
        "The Gobu uprising began over a specific grievance - the corrupt magistrate Jo Byeong-gap's illegal taxation for an unnecessary reservoir - showing how local oppression sparked wider revolution",
        "Jeon Bong-jun's military leadership transformed religious movement into peasant army capable of defeating government forces and capturing provincial capital",
        "The Jeonju Peace Agreement (June 1894) shows rebels' willingness to negotiate reform rather than overthrow - but foreign intervention made peaceful resolution impossible"
      ],
      "realLifeConnections": [
        "The pattern of foreign intervention transforming domestic conflicts into international crises continues today (Syria, Yemen, Ukraine)",
        "Peasant demands for land reform and punishment of corrupt officials remain central to agrarian movements worldwide",
        "The tragic irony: rebels who wanted to protect Korea from foreign influence inadvertently triggered the foreign domination they feared"
      ]
    }
  ],
  "overallSynthesis": "The Tonghak Rebellion represents Korea's 'Taiping moment' - a religious-peasant uprising that challenged the existing order and triggered catastrophic international consequences. The primary sources from Ch'oe Cheu and Ch'oe Sihyong reveal Tonghak as a sophisticated syncretic religion responding to the crisis of the 1860s: Western imperialism, Qing weakness, and domestic corruption. Ch'oe Cheu's claim that 'my mind is your mind' and 'human beings are heaven' provided theological justification for social equality that resonated with peasants suffering under yangban oppression and corrupt officials.\n\nUnlike Hong Xiuquan's Christianity-derived Taiping ideology, Tonghak explicitly positioned itself as 'Eastern Learning' - an indigenous Korean response to the Western threat. This nationalist dimension would prove crucial for Tonghak's long-term legacy, even as the 1894 uprising itself was crushed.\n\nThe secondary source reveals the tragic dynamics of 1894: local grievances against corrupt officials escalated into regional uprising; the weak Joseon government, unable to suppress the rebellion, requested Chinese assistance; Japan, determined not to let China dominate Korea, sent its own troops. The rebellion was suppressed, but Japanese and Chinese forces remained - leading directly to the First Sino-Japanese War. Japan's victory ended the tributary relationship between Korea and China that had structured East Asian international relations for centuries.\n\nThe Tonghak Rebellion thus illustrates a recurring pattern in modern East Asian history: domestic crisis invites foreign intervention, which transforms local conflicts into international wars with consequences far beyond what any participant intended. The peasants who rose up in Gobu to protest an unjust reservoir tax could not have imagined they were triggering a war that would make Japan an imperial power and set Korea on the path to colonization.",
  "executiveSummary": "The Tonghak Rebellion (1894) was Korea's Taiping moment - a religious-peasant uprising that inadvertently triggered the First Sino-Japanese War and ended Chinese influence in Korea. Tonghak ('Eastern Learning') was a syncretic religion founded by Ch'oe Cheu in 1860, combining Confucian ethics, Buddhist-Daoist cosmology, and indigenous Korean traditions into a faith that proclaimed 'human beings are heaven' and all people are equal. This message resonated with peasants suffering under corrupt officials and foreign economic penetration.\n\nWhen Tonghak-led peasants rose in Jeolla Province in 1894, the weak Joseon government requested Chinese military help. Japan, viewing Korea as vital to its security, also sent troops. Though the rebellion was suppressed, neither foreign army withdrew - and war erupted. Japan's decisive victory (1894-95) ended the Sino-Korean tributary relationship, revealed Qing military weakness, and established Japan as the dominant power in Korea. The Treaty of Shimonoseki (1895) forced China to recognize Korean 'independence' - meaning independence from China, not from Japan.\n\nThe Tonghak movement survived its military defeat. Renamed Cheondogyo ('Religion of the Heavenly Way') in 1905, it remains active in both Koreas today. Both North and South Korea claim the Tonghak heritage - the North emphasizing its anti-feudal peasant revolution, the South its proto-democratic nationalism.",
  "keywords": [
    {
      "term": "Tonghak (Eastern Learning)",
      "definition": "Syncretic Korean religion founded 1860 by Ch'oe Cheu, combining Confucian, Buddhist, Daoist, and shamanic elements in explicit opposition to 'Western Learning' (Catholicism)",
      "relevance": "Provided ideological foundation for 1894 peasant uprising; proclaimed human equality ('in nae ch'on') that challenged yangban social hierarchy"
    },
    {
      "term": "Ch'oe Cheu (1824-1864)",
      "definition": "Founder of Tonghak; illegitimate son of a yangban who received mystical revelation in 1860; executed by Joseon government in 1864 for spreading heterodox teachings",
      "relevance": "His martyrdom fueled the movement; Korean parallel to Hong Xiuquan but with indigenous rather than Christian-derived ideology"
    },
    {
      "term": "Ch'oe Sihyong (1827-1898)",
      "definition": "Second leader of Tonghak who organized the movement during its underground years and led it during the 1894 uprising; executed after the rebellion defeat",
      "relevance": "Transformed Tonghak from religious movement into organized force capable of peasant mobilization"
    },
    {
      "term": "Jeon Bong-jun (1855-1895)",
      "definition": "Military leader of the 1894 Tonghak Peasant Army; led successful campaigns capturing Jeonju before defeat at Gongju; executed after capture",
      "relevance": "Symbol of peasant resistance; short stature earned nickname 'General Green Bean' (Nokdu Janggun)"
    },
    {
      "term": "First Sino-Japanese War (1894-95)",
      "definition": "War between Japan and Qing China triggered by their competing interventions in Korea; Japan decisive victory ended Chinese suzerainty over Korea",
      "relevance": "Transformed East Asian international order; revealed Qing weakness; began Japanese empire"
    },
    {
      "term": "In nae ch'on (Human beings are heaven)",
      "definition": "Core Tonghak doctrine teaching that all humans contain divinity and are therefore equal",
      "relevance": "Revolutionary social message that challenged Confucian hierarchy and yangban privilege"
    },
    {
      "term": "Cheondogyo (Religion of the Heavenly Way)",
      "definition": "Name adopted by Tonghak in 1905; the religion continues today in both North and South Korea",
      "relevance": "Shows how the movement survived military defeat and remained relevant to Korean nationalism"
    }
  ],
  "keyPassages": [
    {
      "quote": "My mind is your mind. How could men know it? They may know Heaven and earth, but they know not the spirit. Yet I am the spirit.",
      "source": "Ch'oe Cheu, 'On Learning Truth'",
      "page": "p. 232",
      "verificationPath": "https://drive.google.com/file/d/1iAFLA1nBFcfbgOcfvsaENMy5z4NgRO8_/view"
    },
    {
      "quote": "Human beings are heaven (in nae ch'on) and all are equal; there are no differences among humans, so distinctions of high and low violate God's will.",
      "source": "Ch'oe Sihyong",
      "page": "p. 229",
      "verificationPath": "https://drive.google.com/file/d/1iAFLA1nBFcfbgOcfvsaENMy5z4NgRO8_/view"
    },
    {
      "quote": "In April 1860 the whole world was in turmoil... 'The Westerners cultivated high ethics, and there is nothing they cannot do... even China is being destroyed.'",
      "source": "Ch'oe Cheu, 'On Learning Truth'",
      "page": "p. 232",
      "verificationPath": "https://drive.google.com/file/d/1iAFLA1nBFcfbgOcfvsaENMy5z4NgRO8_/view"
    },
    {
      "quote": "I was born in the East and received the truth in the East. Therefore, the Way is the Heavenly Way and the doctrine is the Eastern Learning.",
      "source": "Ch'oe Cheu, 'On Learning Truth'",
      "page": "p. 233",
      "verificationPath": "https://drive.google.com/file/d/1iAFLA1nBFcfbgOcfvsaENMy5z4NgRO8_/view"
    },
    {
      "quote": "Treat all persons at home as God... Regard your servants as your own children, love even animals.",
      "source": "Ch'oe Sihyong, 'On Practicing Truth at Home'",
      "page": "p. 234",
      "verificationPath": "https://drive.google.com/file/d/1iAFLA1nBFcfbgOcfvsaENMy5z4NgRO8_/view"
    }
  ],
  "peopleplacesthings": {
    "people": [
      "Ch'oe Cheu (1824-1864) - Founder of Tonghak; illegitimate yangban son who received revelation in 1860; executed for heterodoxy 1864",
      "Ch'oe Sihyong (1827-1898) - Second Tonghak leader; organized movement underground; executed after 1894 uprising",
      "Jeon Bong-jun (1855-1895) - Military commander of Tonghak Peasant Army; 'General Green Bean'; captured and executed",
      "Jo Byeong-gap - Corrupt magistrate of Gobu whose illegal taxation sparked the initial uprising",
      "King Gojong (r. 1864-1907) - Joseon monarch who requested Chinese military assistance against rebels",
      "Yuan Shikai - Chinese military commander in Korea; recommended intervention",
      "Son Byong-hui (1861-1922) - Third Tonghak leader; renamed movement Cheondogyo; led March First Movement 1919"
    ],
    "places": [
      "Gobu County - Where uprising began January 1894 over corrupt magistrate's taxation",
      "Jeonju - Provincial capital of Jeolla; captured by Tonghak forces April 1894",
      "Gongju - Site of final battle November 1894; Tonghak forces defeated by Japanese-supported government troops",
      "Jeolla Province - Southern agricultural region; center of Tonghak strength and rebellion",
      "Incheon - Port where Japanese and Chinese forces landed June 1894",
      "Pyongyang - Major battle site of Sino-Japanese War; Japanese victory September 1894",
      "Shimonoseki - Japanese city where peace treaty signed April 1895"
    ],
    "things": [
      "Donggyeong Daejeon (Scripture of Eastern Learning) - Core Tonghak scripture compiled from Ch'oe Cheu's writings",
      "Yongdam Yusa (Songs of Yongdam) - Tonghak religious poetry in Korean vernacular for common believers",
      "Jeonju Peace Agreement (June 1894) - Truce between rebels and government establishing peasant self-governance bureaus",
      "Twelve-Point Reform Program - Tonghak demands including land reform, anti-corruption, and expulsion of foreigners",
      "Treaty of Shimonoseki (1895) - Ended Sino-Japanese War; China recognized Korean 'independence' and ceded Taiwan to Japan",
      "Cheondogyo - Name adopted by Tonghak 1905; 'Religion of the Heavenly Way'"
    ]
  },
  "keyQuestions": [
    {
      "question": "How was Tonghak similar to and different from the Taiping movement in China?",
      "basicAnswer": "Both were peasant rebellions with religious leaders who claimed divine revelations. Both demanded social reform. But Tonghak was 'Eastern Learning' rejecting Christianity, while Taiping was based on Christian ideas. Taiping was much larger and nearly overthrew the Qing; Tonghak never threatened Seoul but triggered an international war.",
      "midAnswer": "SIMILARITIES: Peasant base, charismatic founders with divine visions, social reform demands (land, equality), millenarian elements, brutal suppression. DIFFERENCES: (1) Tonghak EXPLICITLY rejected Western/Christian ideas; Taiping adapted them. (2) Scale: Taiping killed 20-30M; Tonghak was regional. (3) International consequences: Taiping was suppressed with Western help; Tonghak triggered Sino-Japanese War. (4) Survival: Taiping completely destroyed; Tonghak became Cheondogyo, still exists. Why did the SMALLER rebellion have LARGER international consequences?",
      "advancedAnswer": "THE COMPARISON REVEALS STRUCTURAL DIFFERENCES. (1) Korea's strategic position between China and Japan made ANY crisis international. China's crisis could be contained regionally. (2) Taiping threatened the Qing; Tonghak didn't threaten Joseon — so why did Tonghak trigger war? Because the ISSUE wasn't the rebellion but KOREA ITSELF. (3) Foreign powers helped SUPPRESS Taiping because they preferred weak Qing to strong Taiping. Foreign powers USED Tonghak as excuse to intervene because they wanted Korea. (4) Ch'oe Cheu's explicit 'Eastern Learning' vs. Hong Xiuquan's Christian adaptation raises questions about how 'Western' ideas were received. Ch'oe KNEW he was creating an alternative; Hong thought he was understanding the truth. (5) Both movements show that alternatives to the existing order could be imagined — and that imagining alternatives was dangerous."
    },
    {
      "question": "Was Tonghak primarily anti-foreign, reformist, or revolutionary?",
      "basicAnswer": "It was all three. Anti-foreign: founded to counter Western Learning and demanded expulsion of foreign barbarians. Reformist: the Jeonju Peace Agreement showed willingness to work within the system. Revolutionary: 'Human beings are heaven' challenged the entire yangban class system.",
      "midAnswer": "All three elements were in TENSION, not harmony. (1) ANTI-FOREIGN: Founded explicitly against 'Western Learning,' rebels demanded expulsion of Japanese/Western barbarians. (2) REFORMIST: Jeonju Peace Agreement shows willingness to work within system; demands focused on corrupt officials, NOT overthrowing monarchy. (3) REVOLUTIONARY: 'In nae ch'on' (human beings are heaven) challenged the ENTIRE yangban hierarchy; peasant self-governance bureaus were proto-democratic. Foreign intervention prevented us from seeing which tendency would have dominated.",
      "advancedAnswer": "THE CATEGORIES DON'T CAPTURE THE MOVEMENT. (1) 'Anti-foreign' and 'reformist' weren't opposites — Tonghak leaders wanted reform PRECISELY to strengthen Korea against foreigners. (2) 'Revolutionary' in what sense? They didn't want to overthrow the king — they wanted to purify the system. (3) The Jeonju Peace Agreement is CRUCIAL: Tonghak was willing to negotiate, establish self-governance bureaus, work within the system. The REBELLION was over by June 1894. Foreign intervention — not rebel intransigence — made peaceful resolution impossible. (4) Better frame: Tonghak was a MORAL RENEWAL movement that became political because the state was corrupt. 'In nae ch'on' isn't political ideology — it's religious teaching that has political implications. (5) The tragedy: We'll never know what Tonghak would have become because Japan made that question irrelevant."
    },
    {
      "question": "Why did the Tonghak Rebellion trigger war between China and Japan rather than Korean reform?",
      "basicAnswer": "Korea's government was too weak to suppress the rebellion alone and asked China for help. Japan also sent troops, not wanting China to control Korea. Neither army left after the rebellion ended, and war broke out. Korea's location between two empires made its domestic crisis an international conflict.",
      "midAnswer": "Korea's WEAKNESS invited intervention. (1) Government couldn't suppress rebellion alone → requested Chinese troops (under tributary obligations). (2) Japan determined not to let China dominate Korea → sent own troops. (3) Rebellion was actually SUPPRESSED by June 1894 (Jeonju Peace Agreement) — but neither foreign army withdrew. (4) Korea's strategic position meant domestic crisis became international battlefield. The pattern repeats: Korea as 'shrimp among whales.' The rebellion was the PRETEXT, not the cause.",
      "advancedAnswer": "THE REBELLION WAS IRRELEVANT TO THE WAR'S CAUSES. (1) Japan had been preparing to challenge China in Korea for years — Tonghak was convenient pretext. (2) The rebellion was OVER by June 1894 (Jeonju Peace Agreement). Tonghak leaders accepted peace; it was foreign powers that rejected it. (3) China sent troops because treaty obligations required it — but also to assert traditional suzerainty. Japan sent troops to CHALLENGE that suzerainty. (4) The real question: Why was Korea the battlefield? Because Meiji Japan's entire strategic calculation required Korean 'independence' (from China, not from Japan). (5) Pattern analysis: domestic weakness → foreign intervention → international conflict → loss of sovereignty. This pattern would repeat: 1894 (Tonghak), 1904 (Russo-Japanese War fought in Korea), 1950 (Korean War). Korea's geography is destiny. (6) The deepest irony: Tonghak rebels wanted to PROTECT Korea from foreigners. Their rebellion triggered the foreign domination they feared."
    },
    {
      "question": "How has Tonghak been remembered differently in North and South Korea?",
      "basicAnswer": "North Korea sees Tonghak as a revolutionary peasant uprising against feudalism and imperialism—a proto-communist movement. South Korea sees it as a proto-democratic movement for religious freedom and human rights. Both countries claim Tonghak's legacy. The religion survives as Cheondogyo in both Koreas.",
      "midAnswer": "NORTH KOREA: Revolutionary peasant movement against feudalism and imperialism; proto-communist class struggle; anti-imperialist nationalism. Emphasizes class conflict, peasant agency, anti-Japanese resistance. SOUTH KOREA: Proto-democratic movement; religious freedom and human rights; nationalist resistance to foreign aggression. Emphasizes 'in nae ch'on' as human dignity, Jeon Bong-jun as democratic hero. Both claim legitimacy. Cheondogyo survives in BOTH Koreas — one of few organizations spanning the divide.",
      "advancedAnswer": "SAME EVENT, OPPOSITE MEANINGS — which shows that historical memory is POLITICAL. (1) North emphasizes CLASS: peasants vs. yangban, proto-communist revolution. South emphasizes NATION: Koreans vs. foreigners, democratic resistance. (2) North emphasizes STRUGGLE: violent resistance is necessary. South emphasizes NEGOTIATION: Jeonju Peace Agreement shows democratic instincts. (3) Both EDIT the record: North downplays Tonghak's religious elements (incompatible with state atheism); South downplays its violent anti-yangban rhetoric (incompatible with conservative establishment). (4) Cheondogyo's survival in both Koreas is fascinating — it's one of the few institutions that spans the division. What does it mean that the SAME religion serves legitimizing functions for opposing regimes? (5) Broader lesson: History doesn't have a single meaning. Tonghak 'means' whatever contemporary politics needs it to mean. The question isn't 'what really happened?' but 'who controls the interpretation?'"
    }
  ],
  "timeline": [
    {
      "date": "1860",
      "event": "Ch'oe Cheu receives mystical revelation; founds Tonghak (Eastern Learning)"
    },
    {
      "date": "1861",
      "event": "Ch'oe Cheu writes 'On Spreading Virtue' and 'On Learning Truth'"
    },
    {
      "date": "1864",
      "event": "Ch'oe Cheu executed by Joseon government for spreading heterodoxy"
    },
    {
      "date": "1864-1892",
      "event": "Ch'oe Sihyong leads Tonghak underground; movement grows in southern provinces"
    },
    {
      "date": "1892-1893",
      "event": "Tonghak petitions for founder's posthumous pardon and religious recognition"
    },
    {
      "date": "January 1894",
      "event": "Gobu Uprising: Peasants led by Jeon Bong-jun rebel against corrupt magistrate Jo Byeong-gap"
    },
    {
      "date": "March 1894",
      "event": "Tonghak Peasant Army formally organized; issues proclamation against corrupt officials"
    },
    {
      "date": "April 1894",
      "event": "Peasant Army captures Jeonju, provincial capital of Jeolla"
    },
    {
      "date": "June 1894",
      "event": "Joseon government requests Chinese military assistance; Japan also sends troops"
    },
    {
      "date": "June 11, 1894",
      "event": "Jeonju Peace Agreement: Rebels agree to disperse; peasant self-governance bureaus established"
    },
    {
      "date": "July 1894",
      "event": "Japan seizes Korean royal palace; forces reform cabinet"
    },
    {
      "date": "August 1, 1894",
      "event": "First Sino-Japanese War officially begins"
    },
    {
      "date": "September 1894",
      "event": "Battle of Pyongyang: Decisive Japanese victory over Chinese forces"
    },
    {
      "date": "October 1894",
      "event": "Tonghak forces re-mobilize to resist Japanese presence"
    },
    {
      "date": "November 1894",
      "event": "Battle of Gongju: Tonghak forces decisively defeated"
    },
    {
      "date": "December 1894",
      "event": "Jeon Bong-jun captured"
    },
    {
      "date": "March 1895",
      "event": "Jeon Bong-jun executed in Seoul"
    },
    {
      "date": "April 1895",
      "event": "Treaty of Shimonoseki: China recognizes Korean 'independence,' cedes Taiwan to Japan"
    },
    {
      "date": "1898",
      "event": "Ch'oe Sihyong captured and executed"
    },
    {
      "date": "1905",
      "event": "Son Byong-hui renames Tonghak as Cheondogyo (Religion of the Heavenly Way)"
    }
  ],
  "connections": {
    "fromPrevious": "Plate 13 examined China's Taiping Rebellion (1850-1864) - a massive religious-peasant uprising that nearly overthrew the Qing dynasty. The Tonghak Rebellion invites direct comparison: both were led by charismatic founders who claimed divine revelation, both mobilized peasants with promises of social reform, both faced brutal suppression. Key differences: Taiping was influenced by Christianity while Tonghak explicitly rejected Western Learning; Taiping was larger and came closer to success; but Tonghak's international consequences were more dramatic. The suppression of Taiping relied on Western-trained forces and created regional strongmen; Tonghak suppression required foreign intervention that triggered war. Ask students: Why did a smaller rebellion in Korea have larger international consequences than the massive Taiping uprising?",
    "toNext": "Plate 15 (Joseon's Slow Evolution) examines Korea's attempts at reform in the aftermath of the Sino-Japanese War. The Gabo Reforms (1894-1896) implemented many changes the Tonghak rebels had demanded - abolition of slavery, end of status discrimination, modernization of government - but under Japanese pressure rather than Korean initiative. Students should consider: Did Tonghak 'fail' if many of its reform demands were eventually enacted? What's the difference between reform achieved through rebellion vs. reform imposed by foreign power?",
    "broaderThemes": "The Tonghak Rebellion exemplifies several course themes: (1) How domestic crisis invites foreign intervention that transforms local conflicts into international wars; (2) The emergence of indigenous responses to Western imperialism that draw on traditional resources while creating something new; (3) The tension between reform and revolution - Tonghak leaders signed the Jeonju Peace Agreement hoping for reform, but foreign intervention foreclosed that possibility; (4) Korea's tragic position as battleground for larger powers - 'shrimp among whales'; (5) How historical memory serves present politics - both Koreas claim Tonghak for radically different purposes."
  },
  "nextPreview": {
    "plate": 15,
    "topic": "Joseon's Slow Evolution",
    "preview": "In the aftermath of the Tonghak Rebellion and Sino-Japanese War, Korea attempted reforms under Japanese pressure. The Gabo Reforms implemented many Tonghak demands - but could reform imposed by a foreign power satisfy Korean aspirations?",
    "readings": [
      "Encounters with the West / Defense of Orthodoxy (SKT)"
    ]
  },
  "teachingNotes": [
    "The film 'Run High, Run Far' (Plate 16) depicts the Tonghak Rebellion - preview it here so students know to watch for key themes",
    "Ch'oe Cheu's revelation narrative parallels Hong Xiuquan's - both sick, received divine message, founded new religion. But Ch'oe explicitly rejected Christianity; Hong adapted it. Ask students why this difference matters.",
    "The doctrine 'in nae ch'on' (human beings are heaven) is revolutionary - it challenges the entire yangban social order. Connect to modern human rights discourse.",
    "Jeon Bong-jun's nickname 'General Green Bean' (Nokdu Janggun) humanizes him - he was short but commanded loyalty. South Korean democracy activists adopted him as symbol.",
    "The Jeonju Peace Agreement shows rebels weren't trying to overthrow the state - they wanted reform. Foreign intervention, not rebel intransigence, prevented peaceful resolution.",
    "Map the cascade: local grievance (corrupt magistrate) -> regional uprising -> government weakness -> foreign intervention -> international war. This pattern recurs throughout East Asian history.",
    "Both Koreas claim Tonghak legacy - this is a good entry point for discussing how historical memory serves present politics. Cheondogyo still exists in both Koreas.",
    "Connect to present: The pattern of domestic crisis inviting foreign intervention that transforms local conflicts into international wars continues (Syria, Yemen). Korea's experience is not unique.",
    "Ch'oe Sihyong's 'On Practicing Truth at Home' (treat servants as children, love animals, don't cut young trees) shows Tonghak wasn't just political - it offered a complete moral worldview."
  ],
  "map": {
    "center": [
      35.5,
      127
    ],
    "zoom": 7,
    "title": "Tonghak Rebellion and Sino-Japanese War in Korea (1894)",
    "description": "Showing the spread of Tonghak movement, key uprising locations, and foreign intervention routes",
    "locations": [
      {
        "name": "Gobu",
        "nameChinese": "古阜",
        "nameKorean": "고부",
        "lat": 35.45,
        "lng": 126.88,
        "type": "battle",
        "description": "Where Tonghak uprising began January 1894 against corrupt magistrate Jo Byeong-gap"
      },
      {
        "name": "Jeonju",
        "nameChinese": "全州",
        "nameKorean": "전주",
        "lat": 35.82,
        "lng": 127.15,
        "type": "city",
        "description": "Provincial capital of Jeolla; captured by Tonghak forces April 1894; site of Peace Agreement"
      },
      {
        "name": "Gongju",
        "nameChinese": "公州",
        "nameKorean": "공주",
        "lat": 36.45,
        "lng": 127.12,
        "type": "battle",
        "description": "Site of final battle November 1894; Tonghak forces decisively defeated"
      },
      {
        "name": "Hanyang (Seoul)",
        "nameChinese": "漢陽",
        "nameKorean": "한양/서울",
        "lat": 37.57,
        "lng": 126.98,
        "type": "capital",
        "description": "Royal capital; government requested Chinese help; Japan seized palace July 1894"
      },
      {
        "name": "Incheon",
        "nameChinese": "仁川",
        "nameKorean": "인천",
        "lat": 37.46,
        "lng": 126.71,
        "type": "port",
        "description": "Treaty port where Japanese and Chinese forces landed June 1894"
      },
      {
        "name": "Pyongyang",
        "nameChinese": "平壤",
        "nameKorean": "평양",
        "lat": 39.04,
        "lng": 125.76,
        "type": "battle",
        "description": "Major battle of Sino-Japanese War September 1894; decisive Japanese victory"
      },
      {
        "name": "Asan",
        "nameChinese": "牙山",
        "nameKorean": "아산",
        "lat": 36.79,
        "lng": 127.0,
        "type": "battle",
        "description": "Site of first land battle of Sino-Japanese War; Chinese forces defeated July 1894"
      },
      {
        "name": "Gyeongju",
        "nameChinese": "慶州",
        "nameKorean": "경주",
        "lat": 35.86,
        "lng": 129.22,
        "type": "city",
        "description": "Ch'oe Cheu's birthplace in southeastern Korea; Tonghak spread from here"
      }
    ],
    "routes": [
      {
        "name": "Tonghak Spread",
        "description": "Movement spread from southeast to southwest agricultural regions",
        "type": "religious"
      },
      {
        "name": "Japanese Landing",
        "description": "Japanese forces landed at Incheon, moved to Seoul",
        "type": "military"
      },
      {
        "name": "Chinese Landing",
        "description": "Chinese forces landed at Asan to support Joseon government",
        "type": "military"
      }
    ]
  }
}